---
kind: property
id: P:Autodesk.Revit.DB.Structure.PathReinforcement.PathReinforcementType
source: html/01592a23-de13-fd3e-7508-55e1d83994d1.htm
---
# Autodesk.Revit.DB.Structure.PathReinforcement.PathReinforcementType Property

Retrieves the type of the Path Reinforcement.

## Syntax (C#)
```csharp
public PathReinforcementType PathReinforcementType { get; }
```